OdDAI.ApplicationInstance.id
\details
Retrieves the database object identifier of the application instance.
\returns Returns the application instance's database identifier.
\remarks
The method returns a NULL pointer if the application instance is not persistent (i.e. not stored in a database).

OdDAI.ApplicationInstance.unsetAttrCaseInsensitive(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves whether the attribute value is set or is unset  in case insencitive mode.
\param attribute [in] an attribute type.
\returns Returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.ApplicationInstance.putAttrCaseInsensitive(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value of an attribute that is specified by its name in case insencitive mode.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\param val              [in] A new attribute value to be set.
\returns Returns true if the attribute value was successfully set; otherwise, the method returns false.

OdDAI.ApplicationInstance.putAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value of an attribute that is specified by its name.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\param val              [in] A new attribute value to be set.
\returns Returns true if the attribute value was successfully set; otherwise, the method returns false.

OdDAI.ApplicationInstance.testAttr(OdSmartPtr&lt;OdDAI.Attribute&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves whether the attribute value is set or is unset.
\param attribute [in] an attribute type.
\returns Returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.ApplicationInstance.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\returns Returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.ApplicationInstance.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.ApplicationInstance.typeName
\details
Retrieves the type name of the application instance.
\returns Returns an ANSI string that contains the type name.

OdDAI.ApplicationInstance.isKindOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the application instance belongs to a certain entity type with a specified name.
\param entityName [in] A name of entities type.
\returns Returns true if the application instance belongs to the type of entity with the specified name; otherwise, the method returns false.

OdDAI.ApplicationInstance.isInstanceOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the application instance is an instance of an instance type with a specified name.
\param entityName [in] An entity's type name.
\returns Returns true if the application instance is an instance of the specified type; otherwise, the method returns false.

OdDAI.ApplicationInstance.outFields(OdDAI.OdSpfFilerBase*)
\details
Writes values of the instance's explicit attribute fields to a file buffer that is assigned to a specified filer object.
\param wrFiler [in] A raw pointer to the filer object assigned with the file buffer to write data to.
\returns Returns eOk if the attribute fields values are successfully written; otherwise, the method returns an appropriate error.
\remarks
The method's default implementation returns the eNotImplemented value.

OdDAI.ApplicationInstance.inFields(OdDAI.OdSpfFilerBase*)
\details
Reads values of the instance's explicit attribute fields from a file buffer that is associated with a specified filer object.
\param rdFiler [in] A raw pointer to the filer object associated with the file buffer to read data from.
\returns Returns eOk if the attribute fields values are successfully read; otherwise, the method returns an appropriate error.
\remarks
The method's default implementation returns the eNotImplemented value.

OdDAI.ApplicationInstance.owningModel
\details
Retrieves the model that contains the application instance.
\returns Returns a raw pointer to the owning model; if the application instance is not appended to any model, the method returns a NULL pointer.